In [1]:
import sqlhelpers as sh

In [2]:
# %load Exercise Files\\Chapters\\sql-chap08.txt
-- 01 Aggregate Data
-- world.db

SELECT COUNT(*) FROM Country;

SELECT Region, COUNT(*)
  FROM Country
  GROUP BY Region
;

SELECT Region, COUNT(*) AS Count
  FROM Country
  GROUP BY Region
  ORDER BY Count DESC, Region
;

-- album.db

SELECT a.title AS Album, COUNT(t.track_number) as Tracks
  FROM track AS t
  JOIN album AS a
    ON a.id = t.album_id
  GROUP BY a.id
  ORDER BY Tracks DESC, Album
;

SELECT a.title AS Album, COUNT(t.track_number) as Tracks
  FROM track AS t
  JOIN album AS a
    ON a.id = t.album_id
  GROUP BY a.id
  HAVING Tracks >= 10
  ORDER BY Tracks DESC, Album
;

SELECT a.title AS Album, COUNT(t.track_number) as Tracks
  FROM track AS t
  JOIN album AS a
    ON a.id = t.album_id
  WHERE a.artist = "The Beatles"
  GROUP BY a.id
  HAVING Tracks >= 10
  ORDER BY Tracks DESC, Album
;

-- 02 Aggregate functions
-- world.db
SELECT COUNT(*) FROM Country;
SELECT COUNT(Population) FROM Country;
SELECT AVG(Population) FROM Country;
SELECT Region, AVG(Population) FROM Country GROUP BY Region;
SELECT Region, MIN(Population), MAX(Population) FROM Country GROUP BY Region;
SELECT Region, SUM(Population) FROM Country GROUP BY Region;

-- 03 DISTINCT Aggregates
-- world.db

SELECT COUNT(HeadOfState) FROM Country;
SELECT HeadOfState FROM Country ORDER BY HeadOfState;
SELECT COUNT(DISTINCT HeadOfState) FROM Country;

# What are aggregates

In [3]:
# using count
q = "SELECT COUNT(*) FROM Country;"
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT COUNT(*) FROM Country; |||

There are 1 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
   COUNT(*)
0       239

In [4]:
q = """
SELECT Region, COUNT(*)
  FROM Country
  GROUP BY Region
;
"""
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: |||
SELECT Region, COUNT(*)
  FROM Country
  GROUP BY Region
;
 |||

There are 25 rows in the query results table
There are 2 columns in the query results table

First 5 rows of the query results:
                      Region  COUNT(*)
0                 Antarctica         5
1  Australia and New Zealand         5
2           Baltic Countries         3
3            British Islands         2
4                  Caribbean        24

In [5]:
q = """
SELECT Region, COUNT(*) AS Count
  FROM Country
  GROUP BY Region
  ORDER BY Count DESC, Region
;
"""
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: |||
SELECT Region, COUNT(*) AS Count
  FROM Country
  GROUP BY Region
  ORDER BY Count DESC, Region
;
 |||

There are 25 rows in the query results table
There are 2 columns in the query results table

First 5 rows of the query results:
            Region  Count
0        Caribbean     24
1   Eastern Africa     20
2      Middle East     18
3   Western Africa     17
4  Southern Europe     15

In [7]:
q = """
SELECT a.title AS Album, COUNT(t.track_number) as Tracks
  FROM track AS t
  JOIN album AS a
    ON a.id = t.album_id
  GROUP BY a.id
  ORDER BY Tracks DESC, Album
;
"""
sh.query_result_stats(q, "album.db")

### Query Summary ###

DATABASE QUERIED: album.db
QUERY: |||
SELECT a.title AS Album, COUNT(t.track_number) as Tracks
  FROM track AS t
  JOIN album AS a
    ON a.id = t.album_id
  GROUP BY a.id
  ORDER BY Tracks DESC, Album
;
 |||

There are 7 rows in the query results table
There are 2 columns in the query results table

First 5 rows of the query results:
                    Album  Tracks
0             Rubber Soul      14
1           Birds of Fire      10
2  Two Men with the Blues      10
3              Apostrophe       9
4     Hendrix in the West       9

In [8]:
q = """
SELECT a.title AS Album, COUNT(t.track_number) as Tracks
  FROM track AS t
  JOIN album AS a
    ON a.id = t.album_id
  GROUP BY a.id
  HAVING Tracks >= 10
  ORDER BY Tracks DESC, Album
;
"""
sh.query_result_stats(q, "album.db")

### Query Summary ###

DATABASE QUERIED: album.db
QUERY: |||
SELECT a.title AS Album, COUNT(t.track_number) as Tracks
  FROM track AS t
  JOIN album AS a
    ON a.id = t.album_id
  GROUP BY a.id
  HAVING Tracks >= 10
  ORDER BY Tracks DESC, Album
;
 |||

There are 3 rows in the query results table
There are 2 columns in the query results table

First 5 rows of the query results:
                    Album  Tracks
0             Rubber Soul      14
1           Birds of Fire      10
2  Two Men with the Blues      10

In [9]:
# include only albums by the beatles
q = """
SELECT a.title AS Album, COUNT(t.track_number) as Tracks
  FROM track AS t
  JOIN album AS a
    ON a.id = t.album_id
  WHERE a.artist = "The Beatles"
  GROUP BY a.id
  HAVING Tracks >= 10
  ORDER BY Tracks DESC, Album
;
"""
sh.query_result_stats(q, "album.db")

### Query Summary ###

DATABASE QUERIED: album.db
QUERY: |||
SELECT a.title AS Album, COUNT(t.track_number) as Tracks
  FROM track AS t
  JOIN album AS a
    ON a.id = t.album_id
  WHERE a.artist = "The Beatles"
  GROUP BY a.id
  HAVING Tracks >= 10
  ORDER BY Tracks DESC, Album
;
 |||

There are 1 rows in the query results table
There are 2 columns in the query results table

First 5 rows of the query results:
         Album  Tracks
0  Rubber Soul      14

# Using aggregate functions

In [10]:
# useful aggregation functions

q1 = "SELECT Region, AVG(Population) FROM Country GROUP BY Region;"
q2 = "SELECT Region, MIN(Population), MAX(Population) FROM Country GROUP BY Region;"
q3 = "SELECT Region, SUM(Population) FROM Country GROUP BY Region;"

sh.query_result_stats(q1, "world.db")
sh.query_result_stats(q2, "world.db")
sh.query_result_stats(q3, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT Region, AVG(Population) FROM Country GROUP BY Region; |||

There are 25 rows in the query results table
There are 2 columns in the query results table

First 5 rows of the query results:
                      Region  AVG(Population)
0                 Antarctica              NaN
1  Australia and New Zealand     4.550620e+06
2           Baltic Countries     2.520633e+06
3            British Islands     3.169925e+07
4                  Caribbean     1.589167e+06
### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT Region, MIN(Population), MAX(Population) FROM Country GROUP BY Region; |||

There are 25 rows in the query results table
There are 3 columns in the query results table

First 5 rows of the query results:
                      Region  MIN(Population)  MAX(Population)
0                 Antarctica              NaN              NaN
1  Australia and New Zealand            600.0       18886000.0
2           Baltic Countries        1439200.0        3698500.0
3            British Islands        3775100.0       59623400.0
4                  Caribbean           8000.0       11201000.0
### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT Region, SUM(Population) FROM Country GROUP BY Region; |||

There are 25 rows in the query results table
There are 2 columns in the query results table

First 5 rows of the query results:
                      Region  SUM(Population)
0                 Antarctica              NaN
1  Australia and New Zealand       22753100.0
2           Baltic Countries        7561900.0
3            British Islands       63398500.0
4                  Caribbean       38140000.0

# Aggregating distinct values

In [12]:
# how many rows in HeadOfState column
q = "SELECT COUNT(HeadOfState) FROM Country;"
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT COUNT(HeadOfState) FROM Country; |||

There are 1 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
   COUNT(HeadOfState)
0                 238

In [14]:
# how many unique heads of state are there
q = "SELECT COUNT(DISTINCT HeadOfState) FROM Country;"
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT COUNT(DISTINCT HeadOfState) FROM Country; |||

There are 1 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
   COUNT(DISTINCT HeadOfState)
0                          179

In [15]:
q = "SELECT HeadOfState FROM Country ORDER BY HeadOfState;"
sh.query_result_stats(q, "world.db")

### Query Summary ###

DATABASE QUERIED: world.db
QUERY: ||| SELECT HeadOfState FROM Country ORDER BY HeadOfState; |||

There are 239 rows in the query results table
There are 1 columns in the query results table

First 5 rows of the query results:
               HeadOfState
0                     None
1
2
3     Abdelaziz Bouteflika
4  Abdiqassim Salad Hassan